---
type: TextBoxEnterPressedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# TextBoxEnterPressedEventArgs

`Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TextBoxEnterPressedEventArgs | — | `public TextBoxEnterPressedEventArgs ()` |